Autodesk.Revit.DB.SpatialElementBoundarySubface.GetBoundingElementFace
Returns the face of the bounding element.
Remarks:
Applies only if the options chosen for the extraction of the element's geometry is Finish.
Faces do not contain voids in room-bounding elements (such the voids in walls created by doors and windows).
Returns:
The face of the bounding element.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.GetSubface
Returns a face that represents the portion of the room face bounded by the boundary element.
Remarks:
If the spatial element's face is adjacent to multiple bounding elements (such as two different walls), there will be one sub-face
for each portion of the spatial element's face where it is adjacent to one of those room-bounding elements.
This is equivalent to the return of GetRoomFace() if the entire room face is created by the boundary element.
Returns:
The sub-face.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.GetSpatialElementFace
Returns the face of the spatial element's 3D geometry.
Returns:
The face of the spatial element's 3D geometry.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SpatialElementBoundarySubface.Valid
Indicates if the subface instance is valid and can be used.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceType
Type of the subface.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceArisesFromElementFace
Indicates if the subface is coincident with a portion of a (possibly offset) face of the element.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface.SpatialBoundaryElement
Element that gave rise to this room face.
Since:
2012

Autodesk.Revit.DB.SpatialElementBoundarySubface
SpatialElementBoundarySubface represents the geometry boundary information of spatial element.
Since:
2012